Jdubz/Adafruit_nRF52_Bootloader/src/main.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 Ha Thach for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/**
 * -# Receive start data packet.
 * -# Based on start packet, prepare NVM area to store received data.
 * -# Receive data packet.
 * -# Validate data packet.
 * -# Write Data packet to NVM.
 * -# If not finished - Wait for next packet.
 * -# Receive stop data packet.
 * -# Activate Image, boot application.
 *
 */
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stddef.h>

#include "nrfx.h"
#include "nrf_clock.h"
#include "nrfx_power.h"
#include "nrfx_pwm.h"

#include "nordic_common.h"
#include "sdk_common.h"
#include "dfu_transport.h"
#include "bootloader.h"
#include "bootloader_util.h"

#include "nrf.h"
#include "nrf_soc.h"
#include "nrf_nvic.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "ble.h"
#include "nrf.h"
#include "ble_hci.h"
#include "app_scheduler.h"
#include "nrf_error.h"

#include "boards.h"

#include "pstorage_platform.h"
#include "nrf_mbr.h"
#include "pstorage.h"
#include "nrfx_nvmc.h"

#ifdef NRF_USBD
#include "uf2/uf2.h"
#include "nrf_usbd.h"
#include "tusb.h"

void usb_init(bool cdc_only);
void usb_teardown(void);

// tinyusb function that handles power event (detected, ready, removed)
// We must call it within SD's SOC event handler, or set it as power event handler if SD is not enabled.
extern void tusb_hal_nrf_power_event(uint32_t event);

#else

#define usb_init(x)       led_state(STATE_USB_MOUNTED) // mark nrf52832 as mounted
#define usb_teardown()

#endif

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+

/*
 * Blinking patterns:
 * - DFU Serial     : LED Status blink
 * - DFU OTA        : LED Status & Conn blink at the same time
 * - DFU Flashing   : LED Status blink 2x fast
 * - Factory Reset  : LED Status blink 2x fast
 * - Fatal Error    : LED Status & Conn blink one after another
 */

/* Magic that written to NRF_POWER->GPREGRET by application when it wish to go into DFU
 * - DFU_MAGIC_OTA_APPJUM        : used by BLEDfu service, SD is already inited
 * - DFU_MAGIC_OTA_RESET         : entered by soft reset, SD is not inited yet
 * - DFU_MAGIC_SERIAL_ONLY_RESET : with CDC interface only
 * - DFU_MAGIC_UF2_RESET         : with CDC and MSC interfaces
 * - DFU_MAGIC_SKIP              : skip DFU entirely including double reset delay,
 *                                 Can be used with systemoff or quick reset to app
 *
 * Note: for DFU_MAGIC_OTA_APPJUM Softdevice must not initialized.
 * since it is already in application. In all other case of OTA SD must be initialized
 */
#define DFU_MAGIC_OTA_APPJUM            BOOTLOADER_DFU_START  // 0xB1
#define DFU_MAGIC_OTA_RESET             0xA8
#define DFU_MAGIC_SERIAL_ONLY_RESET     0x4e
#define DFU_MAGIC_UF2_RESET             0x57
#define DFU_MAGIC_SKIP                  0x6d
#define DFU_MAGIC_QSPI_APPLY           0xCC  // Apply staged firmware from QSPI flash

#define DFU_DBL_RESET_MAGIC             0x5A1AD5      // SALADS
#define DFU_DBL_RESET_APP               0x4ee5677e
#define DFU_DBL_RESET_DELAY             500
#define DFU_DBL_RESET_MEM               0x20007F7C

// RAM-based bootloader entry: firmware writes these to DFU_DBL_RESET_MEM
// instead of GPREGRET. RAM at 0x20007F7C survives system reset (proven by
// double-reset detection above). Unlike GPREGRET, RAM is not affected by
// USB hub port power-cycling during device reset.
#define DFU_RAM_MAGIC_UF2              0xBEEF0057
#define DFU_RAM_MAGIC_BLE              0xBEEF00A8
#define DFU_RAM_MAGIC_QSPI             0xBEEF00CC

// Boot-attempt counter (OPEN_ISSUES §3.1 / [[project-bl-no-app-crash-fallback]]).
// RAM word at 0x20007F78 — one word below DFU_DBL_RESET_MEM, in the
// SoftDevice-reserved zone but at the very top where the SD does not
// actually allocate. Same "borrow the top of SD's region" pattern as
// DFU_DBL_RESET_MEM. The firmware-side linker (Adafruit nRF52 BSP) does
// not declare a variable at this address; per-attempt collision risk is
// the same as DFU_DBL_RESET_MEM (which has worked since v28).
//
// Word layout: upper 24 bits = sentinel (BOOT_ATTEMPT_SENTINEL), lower
// 8 bits = consecutive attempts since the last app handshake. The
// sentinel disambiguates "uninitialised RAM that happens to look like a
// valid count" from a real count — random RAM matching the sentinel is
// a 1-in-2^24 collision, low enough to ignore.
//
// Increment: ``main()`` bumps the count just before
// ``bootloader_app_start()``. Clear: firmware writes
// ``BOOT_ATTEMPT_SENTINEL | 0`` once it reaches a known-good runtime
// state (``SafeBootWatchdog::markStable()`` site at 60 s uptime).
// Trigger: ``check_dfu_mode`` reads the counter; if ≥ THRESHOLD, forces
// ``dfu_start = 1`` so the BL enters DFU mode instead of jumping to a
// crash-looping app.
#define BOOT_ATTEMPT_COUNTER_MEM        0x20007F78
#define BOOT_ATTEMPT_SENTINEL           0xCAFE0000
#define BOOT_ATTEMPT_SENTINEL_MASK      0xFFFFFF00
#define BOOT_ATTEMPT_COUNT_MASK         0x000000FF
#define BOOT_ATTEMPT_THRESHOLD          3

#define BOOTLOADER_VERSION_REGISTER     NRF_TIMER2->CC[0]
#define DFU_SERIAL_STARTUP_INTERVAL     1000

// Allow for using reset button essentially to swap between application and bootloader.
// This is controlled by a flag in the app and is the behavior of CPX and all Arcade boards when using MakeCode.
// DFU_DBL_RESET magic is used to determined which mode is entered
#define APP_ASKS_FOR_SINGLE_TAP_RESET() (*((uint32_t*)(DFU_BANK_0_REGION_START + 0x200)) == 0x87eeb07c)

// These value must be the same with one in dfu_transport_ble.c
#define BLEGAP_EVENT_LENGTH             6
// Bumped 23 → 247 to lift the legacy DFU 20-byte-per-packet ceiling.
// At MTU=247, ATT data payload is 244 bytes per write, which makes a
// ~510 KB BLE-DFU transfer ~12x faster (≈30 s vs ≈5.5 min legacy).
// MUST match the same define in dfu_transport_ble.c (the local define
// there shadows this one).
// OPEN_ISSUES §3.3 / [[feedback-enclosed-devices-no-physical]].
#define BLEGATT_ATT_MTU_MAX             247
enum { BLE_CONN_CFG_HIGH_BANDWIDTH = 1 };

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+
uint32_t* dbl_reset_mem = ((uint32_t*)  DFU_DBL_RESET_MEM );
uint32_t* boot_attempt_counter = ((uint32_t*) BOOT_ATTEMPT_COUNTER_MEM);

// true if ble, false if serial
bool _ota_dfu = false;
bool _ota_connected = false;
bool _sd_inited = false;

bool is_ota(void)
{
  return _ota_dfu;
}

static void check_dfu_mode(void);
static uint32_t ble_stack_init(void);

// The SoftDevice must only be initialized if a chip reset has occurred.
// Soft reset (jump ) from application must not reinitialize the SoftDevice.
static void mbr_init_sd(void)
{
  PRINTF("SD_MBR_COMMAND_INIT_SD\r\n");
  sd_mbr_command_t com = { .command = SD_MBR_COMMAND_INIT_SD };
  sd_mbr_command(&com);
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+
int main(void)
{
  // Populate Boot Address and MBR Param into MBR if not already
  // MBR_BOOTLOADER_ADDR/MBR_PARAM_PAGE_ADDR are used if available, else UICR registers are used
  // Note: skip it for now since this will prevent us to change the size of bootloader in the future
  // bootloader_mbr_addrs_populate();

